src/Documents/ProductAccountingOperation.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Document>
		<Properties>
			<Name>ProductAccountingOperation</Name>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Inventory</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>OperationContent</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/Inventory.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<AccumulationRegister>
		<Properties>
			<Name>Inventory</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Quantity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Product</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Products</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Warehouse</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Warehouses</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Documents/ProductAccountingOperation/Ext/ObjectModule.bsl
//////////////////////////////////////////////////////////////////////////////// 
// EVENT HANDLERS 
// 

// The document copying handler performs also the RegisterRecords copying
Procedure OnCopy(CopiedObject)
	CopiedObject.RegisterRecords.Inventory.Read();
    For Each SrcRecord In CopiedObject.RegisterRecords.Inventory Do
		Write = RegisterRecords.Inventory.Add();
		Write.RecordType = SrcRecord.RecordType;
		Write.Product = SrcRecord.Product;
		Write.Warehouse = SrcRecord.Warehouse;
		Write.Quantity = SrcRecord.Quantity;
	EndDo;
EndProcedure

// The before writing event handler sets the document date for all
// RegisterRecords
Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	
	For Each Write In RegisterRecords.Inventory Do
		Write.Period = Date;
	EndDo;	
	
EndProcedure
